[
	{
		"title": "Projekt Cinemania",
		"technologies": "HTML5, CSS, JS, Rest API",
		"description": "The Cinemania project is a web application designed for browsing movie information. It leverages modern technologies and libraries such as HTML, CSS, JavaScript, and Vite. The application integrates with the external The Movie Database (TMDb) API, allowing users to search and retrieve detailed information about movies, including descriptions and trailers. Key libraries used in the project include modal-video for content display in modals, lodash for event throttling, iziToast for visual notifications, and axios for handling HTTP requests. Users can explore trending movies, view detailed information, and check ratings. They can also add and remove movies from their personal library. Interactive features, including responsive modals and a layout adaptable to various devices, provide a modern user experience. The goal of the project was to demonstrate skills in API integration, creating dynamic components, and designing a contemporary, responsive web application interface.",
		"liveLink": "https://martapaszkowska.github.io/project-cinemania/",
		"githubLink": "https://github.com/example/personal-wallhttps://github.com/MartaPaszkowska/project-cinemania",
		"image": "https://res.cloudinary.com/dtjbopwfa/image/upload/v1740762441/cinemaniaImage_sntlir.jpg"
	},
	{
		"title": "Project IceCream",
		"technologies": "HTML5, CSS, JS",
		"description": "This is my first group project, created as part of the Fullstack Developer course at GOIT. The project was implemented based on a Figma mockup, and our task was to develop it according to the designer's guidelines. I was responsible for the About Production section, creating aesthetic and functional elements consistent with the overall design. Working on the project taught me remote collaboration, task management in Trello, and effective team communication.",
		"liveLink": "https://peterpoterek.github.io/goit-icecream-copy/",
		"githubLink": "https://github.com/MartaPaszkowska/goit-icecream-project",
		"image": "https://res.cloudinary.com/dtjbopwfa/image/upload/v1740855055/projektIceCream_yabwgb.png"
	},
	{
		"title": "Projekt WebStudio",
		"technologies": "HTML5, CSS, JavaScript",
		"description": "WebStudio! This is my first project created as part of the Full-stack Developer course for the GOIT school. The website includes: A mobile navigation menu. A dynamic portfolio gallery, adapted to various screen resolutions. A modular contact form for collecting user information. A modern design, compliant with UI UX principles. The project was created to demonstrate the application of HTML, CSS, and JavaScript techniques in building web applications.",
		"liveLink": "https://martapaszkowska.github.io/goit-markup-hw-07/",
		"githubLink": "https://github.com/MartaPaszkowska/goit-markup-hw-07",
		"image": "https://res.cloudinary.com/dtjbopwfa/image/upload/v1740935970/webStudioImages_c3wp50.png"
	},
	{
		"title": "Projekt  Wallet",
		"technologies": "HTML5, CSS, JavaScript, React, Redux, Node.js, Express, MongoDB, JWT",
		"description": "",
		"liveLink": "",
		"githubLink": "",
		"image": ""
	},{
		"title": "DevFolio",
		"technologies": "HTML5, CSS, JavaScript, React, Redux, Node.js, Express, MongoDB, Postman",
		"description": "",
		"liveLink": "",
		"githubLink": "",
		"image": "https://res.cloudinary.com/dtjbopwfa/image/upload/v1740937723/devFolioImage_upqgwk.png"
	}
]
